DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
private:
    
    typedef enum 
    {
        MATCH_ROM        = 0x55,
        SEARCH_ROM       = 0xF0,
        SKIP_ROM         = 0xCC,
        CONVERT_T        = 0x44,
        READ_SCRATCHPAD  = 0xBE,
        WRITE_SCRATCHPAD = 0x4E,
        TH_REGISTER      = 0x4B,
        TL_REGISTER      = 0x46,
        COPY_SCRATCHPAD  = 0x48,
        RECALL_E2        = 0xB8
    } DS18B20_Commands;

    typedef enum
    {
        DS18B20_Resolution_9_bit  = 0x1F,
        DS18B20_Resolution_10_bit = 0x3F,
        DS18B20_Resolution_11_bit = 0x5F,
        DS18B20_Resolution_12_bit = 0x7F
    } DS18B20_Resolution;
    
    const uint8_t AllDevicessStartConvert[2] = { SKIP_ROM, CONVERT_T };
    static constexpr bool kOneWireNoCRC = false;
    static constexpr uint8_t kOneWire0 = 0x00;
    static constexpr uint8_t kOneWire1 = 0xFF;
    static constexpr uint8_t kOneWireR1 = 0xFF;
    static constexpr uint8_t kOneWireNoRead = 0xFF;
    static constexpr uint8_t kOneWireReadSlot = 0xFF;
    static constexpr uint8_t kCountPerC = 16;
    static constexpr uint16_t kMinimumDelayMsec = 200;
    
    uint8_t m_internalDeviceReadScratchCommand[10] = { MATCH_ROM, 0, 0, 0, 0, 0, 0, 0, 0, READ_SCRATCHPAD };
    uint8_t m_externalDeviceReadScratchCommand[10] = { MATCH_ROM, 0, 0, 0, 0, 0, 0, 0, 0, READ_SCRATCHPAD };
    
    // Буфер скользящее окно.
    float m_intTempBuf[kInternalTempAvgFilterSize] = { };
    double m_intTempSum = 0;
    uint16_t m_intTempHead = 0;
    float m_extTempBuf[kAirTempAvgFilterSize] = {};
    double m_extTempSum = 0;
    uint16_t m_extTempHead = 0;
    // Сокращенно ow_buf.
    volatile uint8_t m_oneWireBuffer[8] = {};
    
    static void OneWire_ToBits(uint8_t ow_byte, volatile uint8_t* ow_bits) 
    {
        uint8_t i;
        for (i = 0; i < 8; i++)
        {
            *ow_bits++ = ow_byte & 0x01 ? kOneWire1 : kOneWire0;
            ow_byte >>= 1;
        }
    }

    // Конвертирует массив из 8 бит в 1 байт (каждый элемент массива должен иметь значение только 0 или 1).
    static uint8_t OneWire_ToByte(volatile uint8_t* ow_bits) 
    {
        uint8_t ow_byte = 0;
        for (uint8_t i = 0; i < 8; i++) 
        {
            ow_byte >>= 1;
            if (*ow_bits == kOneWireR1) 
            {
                ow_byte |= 0x80;
            }
            ow_bits++;
        }

        return ow_byte;
    }
    
    static float Decode(uint8_t* scratch_pad)
    {
        // Температуру мы получаем из двух байт: 0-3 биты это значения после запятой,
        // 4-12 собственно значение температуры, 12-16 знак. Если разрешение 12бит, 
        // то биты значащие, если 11бит, то нулевой не используется, если 9бит, 
        // то не используются с 0-2. Если температура отрицательная, то нужно инвертировать 
        // биты, добавить 1 и вычесть из нуля, чтобы получить отрицательное значение.
    
        const uint8_t TEMP_LSB = 0;
        const uint8_t TEMP_MSB = 1;
    
        uint8_t LSB = scratch_pad[TEMP_LSB];
        uint8_t MSB = scratch_pad[TEMP_MSB];
    
        float data;
        uint16_t temperature;
        temperature = LSB | (MSB << 8);
 
        if (temperature & 0x8000) 
        {
            temperature = ~temperature + 1;
            data = 0.0 - (temperature * 0.0625);
            return data;
        }
    
        data = temperature * 0.0625;
        return data;
    }

    void Run()
    {
        g_initializationTask.WaitForPropertiesInitialization();
        
        // Дать немного времени на инициализацию.
        vTaskDelay(10 / portTICK_PERIOD_MS);
    
        TryRegisterNewSensors();
    
        // Готовим команду — чтение памяти устройства.
        memcpy(m_internalDeviceReadScratchCommand + 1, g_properties.InternalTempSensorId, 8);
        memcpy(m_externalDeviceReadScratchCommand + 1, g_properties.ExternalTempSensorId, 8);
    
        SetResolution(DS18B20_Resolution_9_bit, g_properties.InternalTempSensorId);  // Для 9 бит время измерения = 750 msec / 16 = 93.75 msec.
        SetResolution(DS18B20_Resolution_9_bit, g_properties.ExternalTempSensorId);
    
        while (!TryGetFirstTemps())
        {
            Pause();
        }
    
        while (true)
        {
            Pause();
            TryUpdateTemp();   
        }
    }
    
    bool SetResolution(DS18B20_Resolution resolution, uint8_t* deviceId)
    {
        uint8_t scratchpad[9] = { };
    
        uint8_t readScratchCommand[10] = { MATCH_ROM };
        readScratchCommand[9] = READ_SCRATCHPAD;
        memcpy(readScratchCommand + 1, deviceId, 8);
    
        // Читаем память устройства с проверкой контрольной суммы.
        if(!OneWire_Send(readScratchCommand, 10, scratchpad, 9, true))
        {
            return false;
        }
    
        uint8_t configuration = scratchpad[4];
    
        switch (resolution) 
        {
        case DS18B20_Resolution_9_bit:
            // bit 6 = 0 и bit 5 = 0.
            if(BIT_IS_NOT_SET(configuration, 6) && BIT_IS_NOT_SET(configuration, 5))
            {
                return true;	
            }
            break;
        case DS18B20_Resolution_10_bit:
            // bit 6 = 0 и bit 5 = 1.
            if(BIT_IS_NOT_SET(configuration, 6) && BIT_IS_SET(configuration, 5))
            {
                return true;
            }
            break;
        case DS18B20_Resolution_11_bit:
            // bit 6 = 1 и bit 5 = 0.
            if(BIT_IS_SET(configuration, 6) && BIT_IS_NOT_SET(configuration, 5))
            {
                return true;	
            }
            break;
        case DS18B20_Resolution_12_bit:
            // bit 6 = 1 и bit 5 = 1.
            if(BIT_IS_SET(configuration, 6) && BIT_IS_SET(configuration, 5))
            {
                return true;
            }
            break;
        }
    
        if (!SaveResolution(resolution, deviceId))
        {
            return false;
        }
    
        return true;
    }

    bool SaveResolution(DS18B20_Resolution resolution, uint8_t* deviceId)
    {
        // Нужно записать в устройство новые параметры.

        uint8_t setResolutionCommand[] =
        { 
            MATCH_ROM,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            WRITE_SCRATCHPAD,
            TH_REGISTER,
            TL_REGISTER,
            (uint8_t)resolution,
        };
        
        memcpy(setResolutionCommand + 1, deviceId, 8);
        
        if (!OneWire_Send(setResolutionCommand, 13))
        {
            return false;
        }
        
        //	// Восстанавливаем из EEPROM.
        //	uint8_t recallCommand[] = 
        //	{
        //		MATCH_ROM,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		RECALL_E2
        //	};
        //			
        //	memcpy(recallCommand + 1, deviceId, 8);
        //			
        //	if (!OneWire_Send(recallCommand, 10))
        //	{
        //		return false;
        //	}
        //			
        //	vTaskDelay(1000 / portTICK_PERIOD_MS);
        //			
        //	// Читаем память устройства с проверкой контрольной суммы.
        //	if(!OneWire_Send(, 10, scratchpad, 9, true))
        //	{
        //		return false;
        //	}
        
            // Теперь скопировать в EEPROM устройства.
            uint8_t copyScratchpadCommand[] = 
        { 
            MATCH_ROM,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            COPY_SCRATCHPAD
        };
        
        memcpy(copyScratchpadCommand + 1, deviceId, 8);

