DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
        if (!OneWire_Send(copyScratchpadCommand, 10))
        {
            return false;
        }
        
        // Не уверен что это нужно но лучше подождать запись в EEPROM.
        vTaskDelay(20 / portTICK_PERIOD_MS);

        return true;
    }

    // Если датчики заменить на новые то потребуется зарегистрировать их идентификаторы.
    void TryRegisterNewSensors()
    {
        uint8_t oneDevRepeatCount = 0;
        uint8_t twoDevRepeatCount = 0;
        uint8_t newInternalDevice[8] = { };
        uint8_t newExternalDevice[8] = { };
    
repeat:
    
        uint8_t devices[16] = {};
        uint8_t devCount = OneWire_Scan(devices, 2);
    
        // Если в списке только одно устройство и оно новое то зарегистрировать как датчик для бака.
        if(devCount == 1)
        {
            bool isInternalSensor = Common::ArrayEquals(devices, 8, g_properties.InternalTempSensorId, 8);
        
            if (!isInternalSensor)
            {
                bool isExternalSensor = Common::ArrayEquals(devices, 8, g_properties.ExternalTempSensorId, 8);
            
                if (!isExternalSensor)
                {
                    // На шине обнаружено только одно устройство и оно новое.
                    // Значит нужно зарегистрировать его как основной датчик бака.
                    // Но ситуация может быть ошибочной поэтому уведомляем пользователя 
                    // и выдерживаем паузу что-бы пользователь мог прервать перезапись идентификатора.
                
                    if(oneDevRepeatCount == 0)
                    {
                        oneDevRepeatCount++;
                    
                        memcpy(newInternalDevice, devices, 8);      // Запомним ид устройства что-бы сравнить при повторной попытке.
                    
                        RegisteringSensors = true;
                
                        vTaskDelay(10000 / portTICK_PERIOD_MS);
                    
                        // Повторим поиск устройств что-бы дополнительно убедиться что ситуация не ошибочная.
                        goto repeat;
                    }
                    else
                    {
                        if (!Common::ArrayEquals(devices, 8, newInternalDevice, 8))
                        {
                            // Идентификатор изменился - что-то пошло не так. Не будем переписывать значение.
                            return;
                        }
                    
                        memcpy(g_writeProperties.InternalTempSensorId, newInternalDevice, 8);
                
                        if (Common::ArrayEquals(g_writeProperties.InternalTempSensorId, 8, g_writeProperties.ExternalTempSensorId, 8))
                        {
                            memset(g_writeProperties.ExternalTempSensorId, 0, 8);
                        }
                    
                        // Перезаписываем идентификатор датчика.
                        g_eepromHelper.Save();
                    
                        // Пока никто не работает с этим идентификатором можем безопасно перезаписать (не атомарно).
                        memcpy(g_properties.InternalTempSensorId, newInternalDevice, 8);
                    }
                }
            }
        }
        else if(devCount == 2)
        {
            // Если устройств 2, где один это датчик бака, а другое новое то зарегистрировать второй как датчик окружающего воздуха.

            // Является ли первое устройство в массиве датчиком бака.
            bool firstIsInternal = Common::ArrayEquals(devices, 8, g_properties.InternalTempSensorId, 8);
        
            bool secondIsInternal;
        
            if (firstIsInternal)
            {
                secondIsInternal = false;
            }
            else
            {
                secondIsInternal = Common::ArrayEquals(devices + 8, 8, g_properties.InternalTempSensorId, 8);
            }
        
            if (firstIsInternal || secondIsInternal)
            {
                uint8_t* nextDev = firstIsInternal ? devices + 8 : devices;
            
                if (!Common::ArrayEquals(nextDev, 8, g_properties.ExternalTempSensorId, 8))
                {
                    // Обнаружен новый датчик. Предупредим пользователя, выдержим паузу, перечитаем идентификатор и зарегистрируем его как датчик воздуха.
                
                    if(twoDevRepeatCount == 0)
                    {
                        twoDevRepeatCount++;
                    
                        memcpy(newExternalDevice, nextDev, 8);         // Запомним ид устройства что-бы сравнить при повторной попытке.
                    
                        RegisteringSensors = true;
                
                        vTaskDelay(10000 / portTICK_PERIOD_MS);
                    
                        // Повторим поиск устройств что-бы дополнительно убедиться что ситуация не ошибочная.
                        goto repeat;
                    }
                    else
                    {
                        if (!Common::ArrayEquals(nextDev, 8, newExternalDevice, 8))
                        {
                            // Идентификатор изменился - что-то пошло не так. Не будем переписывать значение.
                            return;
                        }
                    
                        memcpy(g_writeProperties.ExternalTempSensorId, newExternalDevice, 8);
                
                        // Перезаписываем идентификатор датчика.
                        g_eepromHelper.Save();
                    
                        // Пока никто не работает с этим идентификатором можем безопасно перезаписать (не атомарно).
                        memcpy(g_properties.ExternalTempSensorId, newExternalDevice, 8);
                    }
                }
            }
        }
    }

    // Отправляет команду 0xF0.
    bool OneWire_Reset() 
    {
        USART_InitTypeDef init_struct =
        {
            .USART_BaudRate = 9600,
            .USART_WordLength = USART_WordLength_8b,
            .USART_StopBits = USART_StopBits_1,
            .USART_Parity = USART_Parity_No,
            .USART_Mode = USART_Mode_Tx | USART_Mode_Rx,
            .USART_HardwareFlowControl = USART_HardwareFlowControl_None
        };
        USART_Init(OneWire_USART, &init_struct);

        // Отправляем 0xF0 на скорости 9600
        USART_ClearFlag(OneWire_USART, USART_FLAG_TC);
        USART_SendData(OneWire_USART, 0xF0);
    
        while (USART_GetFlagStatus(OneWire_USART, USART_FLAG_TC) == RESET) 
        {
            taskYIELD();
        }

        uint8_t ow_presence = USART_ReceiveData(OneWire_USART);

        init_struct = 
        {
            .USART_BaudRate = 115200,
            .USART_WordLength = USART_WordLength_8b,
            .USART_StopBits = USART_StopBits_1,
            .USART_Parity = USART_Parity_No,
            .USART_Mode = USART_Mode_Tx | USART_Mode_Rx,
            .USART_HardwareFlowControl = USART_HardwareFlowControl_None
        };
        USART_Init(OneWire_USART, &init_struct);

        if (ow_presence != 0xF0) 
        {
            return true;
        }
        return false;
    }

    bool ValidateCrc32(uint8_t* data, uint8_t length)
    {
        uint8_t crc = 0;
        while (length--)
        {
            CalcCrc32_ibutton_update(crc, *data++);
        }
        
        return crc == 0;
    }

