DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
    // Polynomial: x^8 + x^5 + x^4 + 1 (0x8C)
    void CalcCrc32_ibutton_update(uint8_t &crc, uint8_t data)
    {
        crc = crc ^ data;
        for (uint8_t i = 0; i < 8; i++)
        {
            if (crc & 0x01)
            {
                crc = (crc >> 1) ^ 0x8C;
            }
            else 
            {
                crc >>= 1;
            }
        }
    }

    //-----------------------------------------------------------------------------
    // Процедура общения с шиной 1-wire.
    // Выполняет Reset, затем отправляет команду, затем читает 8 бит (по факту 8 байт) в глобальный
    // буфер _oneWireBuffer. Затем, опционально, копирует полученный байт в массив data.
    // command - массив байт, отсылаемых в шину
    // cLen - длина строки command, столько байт отошлётся в шину.
    // data - если требуется чтение, то ссылка на буфер для чтения, иначе 0.
    // dLen - длина буфера для чтения. Прочитается не более этой длины. Фактически сколько раз будет повторяться вся процедура.
    //-----------------------------------------------------------------------------
    bool OneWire_Send(const uint8_t* command, uint8_t cLen, uint8_t* data = 0, uint8_t dLen = 0, bool calcCrc = true) 
    {	
        if (OneWire_Reset())
        {
            uint8_t* dataStart = data;
            const uint8_t dataLen = dLen;
        
            uint8_t readStart = dLen ? cLen : 255;
            cLen += dLen;
            
            while (cLen--) 
            {
                uint8_t byte = cLen < dLen ? 0xFF : *command++;
                OneWire_ToBits(byte, m_oneWireBuffer);

                // Сбросить читающий канал DMA на значения по умолчанию, перед установкой новых значений (опционально).
                DMA_DeInit(OW_DMA_CH_RX);
            
                DMA_InitTypeDef dmaInitStructure = 
                {
                    .DMA_PeripheralBaseAddr = (uint32_t)&(OneWire_USART->DR),
                    .DMA_MemoryBaseAddr = (uint32_t)m_oneWireBuffer,
                    .DMA_DIR = DMA_DIR_PeripheralSRC,
                    .DMA_BufferSize = 8,
                       // 8 байт которые интерпретируем как 8 бит.
                    .DMA_PeripheralInc = DMA_PeripheralInc_Disable,
                    .DMA_MemoryInc = DMA_MemoryInc_Enable,
                    .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,
                    .DMA_MemoryDataSize = DMA_MemoryDataSize_Byte,
                    .DMA_Mode = DMA_Mode_Normal,
                    .DMA_Priority = DMA_Priority_Low,
                    .DMA_M2M = DMA_M2M_Disable,
                };
            
                // Настроить читающий канал DMA.
                DMA_Init(OW_DMA_CH_RX, &dmaInitStructure);

                // Сбросить записывающий канал DMA на значения по умолчанию, перед установкой новых значений (опционально).
                DMA_DeInit(OW_DMA_CH_TX);
            
                dmaInitStructure = 
                {
                    .DMA_PeripheralBaseAddr = (uint32_t)&(OneWire_USART->DR),
                    .DMA_MemoryBaseAddr = (uint32_t)m_oneWireBuffer,
                    .DMA_DIR = DMA_DIR_PeripheralDST,
                    .DMA_BufferSize = 8, 
                     // 8 байт которые интерпретируем как 8 бит.
                    .DMA_PeripheralInc = DMA_PeripheralInc_Disable,
                    .DMA_MemoryInc = DMA_MemoryInc_Enable,
                    .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,
                    .DMA_MemoryDataSize = DMA_MemoryDataSize_Byte,
                    .DMA_Mode = DMA_Mode_Normal,
                    .DMA_Priority = DMA_Priority_Low,
                    .DMA_M2M = DMA_M2M_Disable,
                };
            
                // Настроить записывающий канал DMA.
                DMA_Init(OW_DMA_CH_TX, &dmaInitStructure);

                // Старт цикла отправки.
                USART_ClearFlag(OneWire_USART, USART_FLAG_RXNE | USART_FLAG_TC | USART_FLAG_TXE);
                USART_DMACmd(OneWire_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, ENABLE);  // Запустили UART.
                DMA_Cmd(OW_DMA_CH_RX, ENABLE);  // Запустили DMA на чтение.
                DMA_Cmd(OW_DMA_CH_TX, ENABLE);  // Запустили DMA на запись.

                // Ждем, пока не примем 8 байт (которые сконвертируем в 8 бит).
                while(DMA_GetFlagStatus(OW_DMA_FLAG) == RESET) 
                {
                    taskYIELD();
                }

                // Отключаем DMA.
                DMA_Cmd(OW_DMA_CH_TX, DISABLE);
                DMA_Cmd(OW_DMA_CH_RX, DISABLE);
                USART_DMACmd(OneWire_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, DISABLE);

                // Если прочитанные данные кому-то нужны - запишем их в выходной буфер data.
                if(readStart != 255)
                {
                    if (readStart == 0 && dLen > 0) 
                    {
                        *data++ = OneWire_ToByte(m_oneWireBuffer);
                        dLen--;
                    }
                    else 
                    {
                        readStart--;
                    }
                }
            }
            
            if (calcCrc)
            {
                return ValidateCrc32(dataStart, dataLen);
            }
            return true;
        }
        return false;
    }

    //float TempSensor::Decode(uint8_t* scratchPad)
    //{
    //	const uint8_t TEMP_LSB = 0;
    //	const uint8_t TEMP_MSB = 1;
    //
    //	/*
    //		1. Truncating the 0.5 bit - use a simple & mask: raw & 0xFFFE
    //		2. Convert to 12 bit value (1/16 of °C) - shift left: (raw & 0xFFFE)<<3
    //		3. Subtracting 0.25 (1/4 °C of 1/16) or 0.25/0.0625 = 4: ((raw & 0xFFFE)<<3)-4
    //		4. Add the count (count per c - count remain), count per c is constant of 16, and no need to dived by 16 since we are calculating to the 1/16 of °C: +16 - COUNT_REMAIN 
    //	*/
    //		
    //	// Construct the integer value
    //	int16_t rawTemperature = (((int16_t)scratchPad[TEMP_MSB]) << 8) | scratchPad[TEMP_LSB];
    //	rawTemperature = ((rawTemperature & 0xFFFE) << 3) - 4 + 16 - scratchPad[6];
    //	float temp = rawTemperature * 0.0625f;
    //	return temp;
    //}

    void Pause()
    {
        vTaskDelay(kTempSensorPauseMsec / portTICK_PERIOD_MS);
    }

    // Если датчик не подключен к шине UART, scratchpad будет заполнен значениями 0 из-за подтягивающего резистора.
    // В этом случае контрольная сумма будет пройдена успешно, а расчет температуры будет не верным.
    // Что бы это предотвратить следует проверять значение COUNT_PER_°C которое не должно равняться нулю.
    bool TryUpdateTemp()
    {
        uint8_t scratchpad[9];
        bool internal_success = false;
        
        if (OneWire_Send(AllDevicessStartConvert, 2))
        {
            vTaskDelay(kMinimumDelayMsec / portTICK_PERIOD_MS);	
        
            float internal_temp;
            if (TryGetInternalTemp(internal_temp))
            {
                InternalTemp = internal_temp;
            
                // Записать в скользящее окно.
                m_intTempSum -= m_intTempBuf[m_intTempHead];
                m_intTempSum += InternalTemp;
                m_intTempBuf[m_intTempHead] = InternalTemp;
                m_intTempHead = (m_intTempHead + 1) % g_properties.InternalTempAvgFilterSize;
                AverageInternalTemp = m_intTempSum / g_properties.InternalTempAvgFilterSize;
            }
        
            float air_temp;
            if (TryGetExternalTemp(air_temp))
            {
                ExternalTemp = air_temp;
                // Записать в скользящее окно.
                m_extTempSum -= m_extTempBuf[m_extTempHead];
                m_extTempSum += ExternalTemp;
                m_extTempBuf[m_extTempHead] = ExternalTemp;
                m_extTempHead = (m_extTempHead + 1) % kAirTempAvgFilterSize;
                AverageExternalTemp = m_extTempSum / kAirTempAvgFilterSize;
                return internal_success;
            }
        }
        return false;
    }

