DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
    bool TryGetFirstTemps()
    {
        uint8_t scratchpad[9];
        bool internalSuccess = false;
    
        // PS. У датчиков по умолчанию значение температуры = 85 градусов С.
    
        if(OneWire_Send(AllDevicessStartConvert, 2))
        {
            vTaskDelay(kMinimumDelayMsec / portTICK_PERIOD_MS);	
        
            float internalTemp;
            if (TryGetInternalTemp(internalTemp))
            {
                InternalTemp = internalTemp;
                InitAverageInternalTemp(internalTemp);  // Заполнить скользящий буфер первым измерением.
                AverageInternalTemp = internalTemp;
                InternalSensorInitialized = true;
            }
        
            float externalTemp;
            if (TryGetExternalTemp(externalTemp))
            {
                ExternalTemp = externalTemp;
                InitAverageExternalTemp(externalTemp);  // Заполнить скользящий буфер первым измерением.
                AverageExternalTemp = externalTemp;
                ExternalSensorInitialized = true;
            }
        }
        return InternalSensorInitialized && ExternalSensorInitialized;
    }

    bool TryGetInternalTemp(float& internal_temp)
    {
        uint8_t scratchpad[9];
        
        // Читаем блокнот конкретного устройства.
        if(OneWire_Send(m_internalDeviceReadScratchCommand, 10, scratchpad, 9, true))
        {
            // Значение COUNT_PER_°C должно равняться заданной разрядности.
            uint8_t count_per_c = scratchpad[7];
            if (count_per_c == kCountPerC)
            {
                internal_temp = Decode(scratchpad);
                return true;
            }
        }
        return false;
    }

    bool TryGetExternalTemp(float& air_temp)
    {
        uint8_t scratchpad[9];
    
        if (OneWire_Send(m_externalDeviceReadScratchCommand, 10, scratchpad, 9, true))
        {
            uint8_t count_per_c = scratchpad[7];
            if (count_per_c == kCountPerC)
            {
                air_temp = Decode(scratchpad);
                return true;
            }
        }
        return false;
    }

    // Заполняет весь скользящий буфер одним значением.
    void InitAverageInternalTemp(const float internal_temp)
    {
        m_intTempSum = internal_temp * g_properties.InternalTempAvgFilterSize;
        for (size_t i = 0; i < g_properties.InternalTempAvgFilterSize; i++)
        {
            m_intTempBuf[i] = internal_temp;
        }
        m_intTempHead = 0;
    }

    // Заполняет весь скользящий буфер одним значением.
    void InitAverageExternalTemp(const float external_temp)
    {
        m_extTempSum = external_temp * kAirTempAvgFilterSize;
        for (size_t i = 0; i < kAirTempAvgFilterSize; i++)
        {
            m_extTempBuf[i] = external_temp;
        }
        m_extTempHead = 0;
    }
    
    //-----------------------------------------------------------------------------
    // Данная функция осуществляет сканирование сети 1-wire и записывает найденные
    //   ID устройств в массив buf, по 8 байт на каждое устройство.
    // переменная num ограничивает количество находимых устройств, чтобы не переполнить
    // буфер.
    //-----------------------------------------------------------------------------
    uint8_t OneWire_Scan(uint8_t* buf, uint8_t num) 
    {
        uint8_t found = 0;
        uint8_t* lastDevice;
        uint8_t* curDevice = buf;
        uint8_t numBit, lastCollision, currentCollision, currentSelection;

        const uint8_t searchRomCommand[1] = { SEARCH_ROM };
    
        lastCollision = 0;
        while (found < num) 
        {
            numBit = 1;
            currentCollision = 0;

            // Посылаем команду на поиск устройств.
            OneWire_Send(searchRomCommand, 1, 0, 0);
        
            for (numBit = 1; numBit <= 64; numBit++) 
            {
                // Читаем два бита. Основной и комплементарный.
                OneWire_ToBits(kOneWireReadSlot, m_oneWireBuffer);
                OneWire_SendBits(2);

                if (m_oneWireBuffer[0] == kOneWireR1) 
                {
                    if (m_oneWireBuffer[1] == kOneWireR1) 
                    {
                        // Две единицы, где-то провтыкали и заканчиваем поиск.
                        return found;
                    }
                    else 
                    {
                        // 10 - на данном этапе только 1.
                        currentSelection = 1;
                    }
                }
                else 
                {
                    if (m_oneWireBuffer[1] == kOneWireR1) 
                    {
                        // 01 - на данном этапе только 0.
                        currentSelection = 0;
                    }
                    else 
                    {
                        // 00 - коллизия.
                        if(numBit < lastCollision) 
                        {
                            // идем по дереву, не дошли до развилки.
                            if(lastDevice[(numBit - 1) >> 3] & 1 << ((numBit - 1) & 0x07)) 
                            {
                                // (numBit-1)>>3 - номер байта.
                                // (numBit-1)&0x07 - номер бита в байте.
                                currentSelection = 1;

                                // если пошли по правой ветке, запоминаем номер бита.
                                if(currentCollision < numBit) 
                                {
                                    currentCollision = numBit;
                                }
                            }
                            else 
                            {
                                currentSelection = 0;
                            }
                        }
                        else 
                        {
                            if (numBit == lastCollision) 
                            {
                                currentSelection = 0;
                            }
                            else 
                            {
                                // идем по правой ветке.
                                currentSelection = 1;

