DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
                                // если пошли по правой ветке, запоминаем номер бита.
                                if(currentCollision < numBit) 
                                {
                                    currentCollision = numBit;
                                }
                            }
                        }
                    }
                }

                if (currentSelection == 1) 
                {
                    curDevice[(numBit - 1) >> 3] |= 1 << ((numBit - 1) & 0x07);
                    OneWire_ToBits(0x01, m_oneWireBuffer);
                }
                else 
                {
                    curDevice[(numBit - 1) >> 3] &= ~(1 << ((numBit - 1) & 0x07));
                    OneWire_ToBits(0x00, m_oneWireBuffer);
                }
                OneWire_SendBits(1);
            }
            found++;
            lastDevice = curDevice;
            curDevice += 8;
            if (currentCollision == 0)
            {
                return found;
            }

            lastCollision = currentCollision;
        }
        return found;
    }

    void OneWire_SendBits(uint8_t num_bits) 
    {
        DMA_DeInit(OW_DMA_CH_RX);
    
        DMA_InitTypeDef dmaInitStructure = 
        {
            .DMA_PeripheralBaseAddr = (uint32_t) &(OneWire_USART->DR),
            .DMA_MemoryBaseAddr = (uint32_t) m_oneWireBuffer,
            .DMA_DIR = DMA_DIR_PeripheralSRC,
            .DMA_BufferSize = num_bits,
            .DMA_PeripheralInc = DMA_PeripheralInc_Disable,
            .DMA_MemoryInc = DMA_MemoryInc_Enable,
            .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,
            .DMA_MemoryDataSize = DMA_MemoryDataSize_Byte,
            .DMA_Mode = DMA_Mode_Normal,
            .DMA_Priority = DMA_Priority_Low,
            .DMA_M2M = DMA_M2M_Disable,
        };
    
        DMA_Init(OW_DMA_CH_RX, &dmaInitStructure);
    
        DMA_DeInit(OW_DMA_CH_TX);
    
        dmaInitStructure = 
        {
            .DMA_PeripheralBaseAddr = (uint32_t) &(OneWire_USART->DR),
            .DMA_MemoryBaseAddr = (uint32_t) m_oneWireBuffer,
            .DMA_DIR = DMA_DIR_PeripheralDST,
            .DMA_BufferSize = num_bits,
            .DMA_PeripheralInc = DMA_PeripheralInc_Disable,
            .DMA_MemoryInc = DMA_MemoryInc_Enable,
            .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,
            .DMA_MemoryDataSize = DMA_MemoryDataSize_Byte,
            .DMA_Mode = DMA_Mode_Normal,
            .DMA_Priority = DMA_Priority_Low,
            .DMA_M2M = DMA_M2M_Disable,
        };
    
        DMA_Init(OW_DMA_CH_TX, &dmaInitStructure);

        USART_ClearFlag(OneWire_USART, USART_FLAG_RXNE | USART_FLAG_TC | USART_FLAG_TXE);
        USART_DMACmd(OneWire_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, ENABLE);
        DMA_Cmd(OW_DMA_CH_RX, ENABLE);
        DMA_Cmd(OW_DMA_CH_TX, ENABLE);

        while (DMA_GetFlagStatus(OW_DMA_FLAG) == RESET) 
        {
            taskYIELD();
        }

        DMA_Cmd(OW_DMA_CH_TX, DISABLE);
        DMA_Cmd(OW_DMA_CH_RX, DISABLE);
        USART_DMACmd(OneWire_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, DISABLE);
    }

    uint8_t GetDevider(DS18B20_Resolution resolution) 
    {
        uint8_t devider;
        switch (resolution) 
        {
        case DS18B20_Resolution_9_bit:
            devider = 8;
            break;
        case DS18B20_Resolution_10_bit:
            devider = 4;
            break;
        case DS18B20_Resolution_11_bit:
            devider = 2;
            break;
        case DS18B20_Resolution_12_bit:
        default:
            devider = 1;
            break;
        }

        return devider;
    }
};

extern TempSensorTask g_tempSensorTask;
